Repository: zephyrquest/file-system-command-interpreter
Catalog: fsci.client/Resources/TranslatedText/Text.*.resx
Languages: it

# command.cd.description
source: change the current working directory
it: cambia la cartella di lavoro corrente

# command.cd.success
source: changed current working directory to: {0}
it: nuova cartella di lavoro cambiata a: {0}

# command.cd.synopsis
source: cd <path>
it: cd <percorso>

# command.cd.unsuccess
source: operation failed: could not change current working directory to {0}
it: operazione fallita: non è stato possibile cambiare la cartella di lavoro corrente a {0}

# command.clear.description
source: clear the output area
it: pulisce l'area di output

# command.ls.description
source: list the content inside the current working directory
it: lista il contenuto della cartella di lavoro corrente

# command.mkdir.description
source: create a new directory in the current working directory
it: crea una nuova cartella nella cartella di lavoro corrente

# command.mkdir.success
source: new directory created: {0}
it: nuova cartella creata: {0}

# command.mkdir.synopsis
source: mkdir <dir name>
it: mkdir <nome cartella>

# command.mkdir.unsuccess
source: operation failed: could not create directory with name {0}
it: operazione fallita: non è stato possibile create la cartella con nome {0}

# command.mv.description
source: move a directory and its content inside another directory
it: sposta una cartella ed il suo contenuto in un'altra cartella

# command.mv.success
source: moved directory {0} to {1}
it: spostata la cartella {0} in {1}

# command.mv.synopsis
source: mv <origin> <destination>
it: mv <origine> <destinazione>

# command.mv.unsuccess
source: operation failed: could not move directory {0} to {1}
it: operazione fallita: non è stato possibile spostare la cartella {0} in {1}

# command.pwd.description
source: print the path of the current working directory
it: stampa il percorso della cartella di lavoro corrente

# command.pwd.success
source: current working dir: {0}
it: cartella di lavoro corrente: {0}

# command.rm.description
source: remove a directory and its content
it: elimina una cartella ed il suo contenuto

# command.rm.success
source: removed directory: {0}
it: cartella {0} eliminata

# command.rm.synopsis
source: rm <path>
it: rm <percorso>

# command.rm.unsuccess
source: operation failed: could not remove directory at path {0}
it: operazione fallita: non è stato possibile eliminare la cartella al percorso {0}

# ui.command
source: Command
it: comando

# ui.title
source: File System Command Interpreter
it: Interprete di Comandi di File System

# command.notfound
source: {0}: command not found
it: {0}: comando non trovato

# command.syntaxerror
source: {0}: syntax error (usage {1})
it: {0}: errore di sintassi (utilizzo {1})

# command.help.description
source: list all available commands with their description and synopsis
it: lista i comandi disponibili con la loro descrizione e sinossi

# ui.language
source: Language
it: Lingua

# ui.enter_command
source: Enter your command here
it: Inserisci qui il comando
